clear;
clc;
close all;


% 卫星广播星历读取example
all_eph = read_rinex_nav("brdc2470.01n");
N = length(all_eph);
cv=299792458; 

% 设置
UTC = [1, 9, 4, 2, 0, 0];
PRN = 1; %需要计算的卫星数
GT = [1259.474846	-25212.777647	-8037.932547]*1000; %真实值参考

% 选出需要的卫星(PRN相同)
j = 1;
for i = 1:N
    if(all_eph(i,1) == PRN)
        eph(j,:) = all_eph(i,:);
        j = j+1;
    end
end

%找到和 toe(星历参考时间) 时间相距最近的一套星历
[week, tow] = UTC2GPST(UTC(1), UTC(2), UTC(3), UTC(4), UTC(5), UTC(6));
fprintf("GPST:%d\r\n", tow);
 [~,idx] = min(abs(eph(:, 17) - tow));
 eph = eph(idx, :);

% 抽取星历
M0 = eph(2);
Delta_n = eph( 3);
e = eph( 4);
sqrtA = eph(5);
OMEGA = eph( 6);
i0 = eph(7);
omega =  eph( 8);
OMEGA_DOT = eph(9);
iDOT = eph(10);
Cuc = eph(11);
Cus = eph(12);
Crc = eph(13);
Crs = eph(14);
Cic = eph(15);
Cis = eph(16);
toe = eph(17);
toc = eph(20);
a0 = eph(21);
a1 = eph(22);
a2 = eph(23);


[X, Y, Z, sv_dt] = ch_sat_pos(tow, toc, a0, a1, a2, Crs, Delta_n, M0, Cuc, e, Cus, sqrtA, toe, Cic, OMEGA, Cis, i0, Crc, omega, OMEGA_DOT, iDOT);

fprintf("PRN:%d: 位置: %f %f %f\r\n", PRN, X, Y, Z);
fprintf("卫星钟差:%f s(%fm)\r\n", sv_dt, sv_dt*cv);

delta = norm([X Y Z] - GT); %残差
fprintf("与真实值偏差:%f m\r\n", delta);

% 参考真实值：

% UTC	PRN	X(km)	Y(km)	Z(km)
% [1,9,4,2,0,0]	1	1259.474846	-25212.777647	-8037.932547
% [1,9,4,2,0,0]	2	-24294.870415	-10298.440180	5306.724373
% [1,9,4,2,0,0]	10	-21373.048658	3642.001924	15474.345306
% [1,9,4,4,0,0]	4	-9502.596926	-14094.166971	-20273.986682
% [1,9,4,4,0,0]	5	-20274.509129	13349.329456	-10661.361857
% [1,9,4,4,0,0]	9	-14814.772708	17979.828330	12073.439581
% [1,9,4,6,0,0]	7	-5691.847564	-16925.992852	20092.291343
% [1,9,4,6,0,0]	10	-14610.529541	-6276.801711	-21324.109671
% [1,9,4,6,0,0]	13	12945.657250	-10554.630193	-20634.870395
% [1,9,4,8,0,0]	22	2333.377199	23790.534595	-11291.992119
% [1,9,4,8,0,0]	8	9176.701784	-12716.185920	-21652.750978
% [1,9,4,8,0,0]	24	-11253.381467	-22703.182412	8297.698314


% 组别	UTC	对应的GPS周内秒	卫星号
% 第一组	2001年9月4日2时0分0秒	180000	1
% 第二组	2001年9月4日2时0分0秒	180000	2
% 第三组	2001年9月4日2时0分0秒	180000	10
% 第四组	2001年9月4日4时0分0秒	187200	4
% 第五组	2001年9月4日4时0分0秒	187200	5
% 第六组	2001年9月4日4时0分0秒	187200	9
% 第七组	2001年9月4日6时0分0秒	194400	7
% 第八组	2001年9月4日6时0分0秒	194400	10
% 第九组	2001年9月4日6时0分0秒	194400	13
% 第十组	2001年9月4日8时0分0秒	201600	22
% 第十一组	2001年9月4日8时0分0秒	201600	8
% 第十二组	2001年9月4日8时0分0秒	201600	24



